hw1/app/controllers/parts_controller.rb

  def index
    @parts = Part.all
---
SELECT "parts".* FROM "parts"

  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save
---
INSERT INTO "parts" ("name", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "steering wheel"], ["quantity", 5], ["created_at", "2019-09-12 20:01:23.985256"], ["updated_at", "2019-09-12 20:01:23.985256"]]

    def set_part
      @part = Part.find(params[:id])
---
SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]