app/controllers/parts_controller.rb

SELECT "parts".* FROM "parts"
---
  def index
    @parts = Part.all

INSERT INTO "parts" ("name", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "steering wheel"], ["quantity", 5], ["created_at", "2019-09-12 20:01:23.985256"], ["updated_at", "2019-09-12 20:01:23.985256"]]
---
  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save

SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_part
      @part = Part.find(params[:id])